RAKWireless/RAK-RP-Arduino/boards.txt
WisCoreRAK11300Board.name=WisBlock RAK11300 Board
WisCoreRAK11300Board.build.core=arduino
WisCoreRAK11300Board.build.crossprefix=arm-none-eabi-
WisCoreRAK11300Board.build.compiler_path={runtime.tools.arm-none-eabi-gcc-7-2017q4.path}/bin/
WisCoreRAK11300Board.build.variant=WisBlock_RAK11300_Board
WisCoreRAK11300Board.build.mcu=cortex-m0plus
WisCoreRAK11300Board.build.extra_flags=
WisCoreRAK11300Board.build.fpu=
WisCoreRAK11300Board.build.float-abi=
WisCoreRAK11300Board.build.architecture=cortex-m0plus
WisCoreRAK11300Board.build.board=RASPBERRY_PI_PICO
WisCoreRAK11300Board.build.ldscript=linker_script.ld
WisCoreRAK11300Board.compiler.mbed.arch.define=-DARDUINO_ARCH_RP2040
WisCoreRAK11300Board.compiler.mbed.defines={build.variant.path}/defines.txt
WisCoreRAK11300Board.compiler.mbed.ldflags={build.variant.path}/ldflags.txt
WisCoreRAK11300Board.compiler.mbed.cflags={build.variant.path}/cflags.txt
WisCoreRAK11300Board.compiler.mbed.cxxflags={build.variant.path}/cxxflags.txt
WisCoreRAK11300Board.compiler.mbed.includes={build.variant.path}/includes.txt
WisCoreRAK11300Board.compiler.mbed.extra_ldflags=-lstdc++ -lsupc++ -lm -lc -lgcc -lnosys
WisCoreRAK11300Board.compiler.mbed="{build.variant.path}/libs/libmbed.a"
WisCoreRAK11300Board.vid.0=0x2e8a
WisCoreRAK11300Board.pid.0=0x00C0
WisCoreRAK11300Board.upload.tool=picotool
WisCoreRAK11300Board.upload.protocol=
WisCoreRAK11300Board.upload.use_1200bps_touch=true
WisCoreRAK11300Board.upload.wait_for_upload_port=false
WisCoreRAK11300Board.upload.native_usb=true
WisCoreRAK11300Board.upload.maximum_size=16777216
WisCoreRAK11300Board.upload.maximum_data_size=270336
WisCoreRAK11300Board.bootloader.tool=openocd
WisCoreRAK11300Board.bootloader.config=-f target/rp2040.cfg
WisCoreRAK11300Board.bootloader.programmer=-f interface/cmsis-dap.cfg
